# VertexIndex1 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TriangleInShellComponent..::..VertexIndex1 Property
TriangleInShellComponent Class See Also
---
Index of the triangle's second vertex in the TriangulatedShellComponent's array of vertices.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int VertexIndex1 { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VertexIndex1 As Integer
	Get
```

Visual C++
---
```text
public:
property int VertexIndex1 {
	int get ();
}
```

# See Also
TriangleInShellComponent Class
Autodesk.Revit.DB Namespace